#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/businesscompanyllc/businesscompanyllc-github/runs/run-WxcJhTrduc1aKFQh

Waiting for the plan to start...

Terraform v1.0.10
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_membership.user_1: Refreshing state... [id=businesscompanyllc:sarina]
github_team.organization_managers: Refreshing state... [id=5308184]
github_membership.user_0: Refreshing state... [id=businesscompanyllc:kdmccormick]
github_team_membership.membership_for_user_1: Refreshing state... [id=5308184:sarina]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_membership.user_1 has been changed
  ~ resource "github_membership" "user_1" {
      ~ etag     = "W/\"e6d4b6ab370d7b60fdc5751e749cca741b729e45ee8c6161eabbfa0fdd1a764d\"" -> "W/\"5d1a4fe92e323728ede5da3156cf8b16af772ac4bca47aa2652529c67e98c2c7\""
        id       = "businesscompanyllc:sarina"
        # (2 unchanged attributes hidden)
    }
  # github_team.organization_managers has been changed
  ~ resource "github_team" "organization_managers" {
      ~ etag                      = "W/\"7e2904c72c66c8718f097480e01ff091e9ec0e0d7b8e1e5f9f783ad7839d9b07\"" -> "W/\"07b369a55ec3cbd2fce196444ddea905f2dc61460f345fd00cc573d39068d5a3\""
        id                        = "5308184"
      ~ members_count             = 0 -> 1
        name                      = "organization-managers"
        # (5 unchanged attributes hidden)
    }
  # github_team_membership.membership_for_user_1 has been changed
  ~ resource "github_team_membership" "membership_for_user_1" {
      ~ etag     = "W/\"278a3e279332aebadbabf8e4d60920c5dba1186d544254b298c92cf1dc9a44df\"" -> "W/\"2534125c61f1bb47235dffbdb5815ca80c7c941b3b1d0f487de86abe14c26b59\""
        id       = "5308184:sarina"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.repo_github_configuration.github_branch.default will be created
  + resource "github_branch" "default" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github-configuration"
      + sha           = (known after apply)
      + source_branch = "master"
      + source_sha    = (known after apply)
    }

  # module.repo_github_configuration.github_branch_default.set_default_branch will be created
  + resource "github_branch_default" "set_default_branch" {
      + branch     = "master"
      + id         = (known after apply)
      + repository = "github-configuration"
    }

  # module.repo_github_configuration.github_branch_protection.protect_default_branch will be created
  + resource "github_branch_protection" "protect_default_branch" {
      + allows_deletions        = false
      + allows_force_pushes     = false
      + enforce_admins          = true
      + id                      = (known after apply)
      + pattern                 = "master"
      + repository_id           = (known after apply)
      + require_signed_commits  = false
      + required_linear_history = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "Terraform",
            ]
          + strict   = false
        }
    }

  # module.repo_github_configuration.github_repository.the_repository will be created
  + resource "github_repository" "the_repository" {
      + allow_auto_merge       = true
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = false
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "GitHub organization configuration-as-code, includinging permissions, teams, and repositories."
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = false
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + is_template            = false
      + name                   = "github-configuration"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @kdmccormick, Action: `pull_request`*